import { BotCommand } from "../types";

const HELP_MESSAGE = `
📝 Как начать:
1. Скинь фото чека в чат
2. Ответь (reply) на фото чека. Вызови /parse
📶 Голосование:
3. Ответь (reply) на результат парсинга. Перечисли свои покупки: 1, 4, 7, 11.
🧮 Подсчет:
4. Ответь (reply) на результат парсинга. Вызови /calculate


И кое-что еще. Вот кусочек из чека:
-------------------------
05. LT Pineapple Batavia • 1 * ฿39.00
06. Nut Mix Unsalted • 3 * ฿400.00
07. Lotus Sweet Sao-wa Nae • 1 * ฿79.00
-------------------------
Под номером 6 у нас 3 пачки орехов. Допустим, 2 пачки из них твои.
Тогда ты проголосуешь за них вот так: 6,6
`.trim();

export const startCommand: BotCommand = async (ctx) => {
  await ctx.reply(HELP_MESSAGE);
};
